@echo off & cls & @echo. & @echo.

rem здесь не задана переменная-получатель
rem поэтому должна быть ошибка

set "eDIR_OWNER=%~dp0"
rem ============================================================================
rem ============================================================================

call "%~dp0..\request.bat" 
if errorlevel 1 (@echo [SUCCESS] & exit /b 0)
@echo [FAILED] expected error
@echo [FAILED]
exit /1

rem ============================================================================
rem ============================================================================

